RT-Thread/rt-thread/bsp/mm32f327x/Libraries/MM32F327x/Include/reg_i2c.h
} I2C_TypeDef;
#endif
#ifdef USENNEWREGISTER
typedef struct {
    __IO u32 CR;                                                                ///< Control Register                               offset: 0x00
    __IO u32 TAR;                                                               ///< Target Address Register                        offset: 0x04
    __IO u32 SAR;                                                               ///< Slave Address Register                         offset: 0x08
    __IO u32 RESERVED3;
    __IO u32 DR;                                                                ///< Data Command Register                          offset: 0x10
    __IO u32 SSHR;                                                              ///< SCL High Period Count for Std. Speed Register  offset: 0x14
    __IO u32 SSLR;                                                              ///< SCL Low Period Count for Std. Speed Register   offset: 0x18
    __IO u32 FSHR;                                                              ///< SCL High Period Count for Fast Speed Register  offset: 0x1C
    __IO u32 FSLR;                                                              ///< SCL Low Period Count for Fast Speed Register   offset: 0x20
    __IO u32 RESERVED9;
    __IO u32 RESERVED10;
    __IO u32 ISR;                                                               ///< Interrupt Status Register                      offset: 0x2C
    __IO u32 IMR;                                                               ///< Interrupt Mask Register                        offset: 0x30
    __IO u32 RAWISR;                                                            ///< RAW Interrupt Status Register                  offset: 0x34
    __IO u32 RXTLR;                                                             ///< Receive FIFO Threshold Level Register          offset: 0x38
    __IO u32 TXTLR;                                                             ///< Transmit FIFO Threshold Level Register         offset: 0x3C
    __IO u32 ICR;                                                               ///< Clear All Interrupt Register                   offset: 0x40
    __IO u32 RX_UNDER;                                                          ///< Clear RX_UNDER Interrupt Register              offset: 0x44
    __IO u32 RX_OVER;                                                           ///< Clear RX_OVER Interrupt Register               offset: 0x48
    __IO u32 TX_OVER;                                                           ///< Clear TX_OVER Interrupt Register               offset: 0x4C
    __IO u32 RD_REQ;                                                            ///< Clear RD_REQ Interrupt Register                offset: 0x50
    __IO u32 TX_ABRT;                                                           ///< Clear TX_ABRT Interrupt Register               offset: 0x54
    __IO u32 RX_DONE;                                                           ///< Clear RX_DONE Interrupt Register               offset: 0x58
    __IO u32 ACTIV;                                                             ///< Clear ACTIVITY Interrupt Register              offset: 0x5C
    __IO u32 STOP;                                                              ///< Clear STOP_DET Interrupt Register              offset: 0x60
    __IO u32 START;                                                             ///< Clear START_DET Interrupt Register             offset: 0x64
    __IO u32 GC;                                                                ///< Clear GEN_CALL Interrupt Register              offset: 0x68
    __IO u32 ENR;                                                               ///< Enable Register                                offset: 0x6C
    __IO u32 SR;                                                                ///< Status Register                                offset: 0x70
    __IO u32 TXFLR;                                                             ///< Transmit FIFO Level Register                   offset: 0x74
    __IO u32 RXFLR;                                                             ///< Receive FIFO Level Register                    offset: 0x78
    __IO u32 HOLD;                                                              ///< SDA Hold Time Register                         offset: 0x7C
    __IO u32 RESERVED28;
    __IO u32 RESERVED29;
    __IO u32 RESERVED30;
    __IO u32 RESERVED30a;
    __IO u32 SETUP;                                                             ///< SDA Setup Time Register                        offset: 0x94
    __IO u32 GCR;                                                               ///< ACK General Call Register                      offset: 0x98
} I2C_TypeDef;
#endif
#ifdef USENOLDREGISTER
typedef struct {
    __IO u32 IC_CON;
    __IO u32 IC_TAR;
    __IO u32 IC_SAR;
    __IO u32 IC_HS_MADDR_RESERVED;
    __IO u32 IC_DATA_CMD;
    __IO u32 IC_SS_SCL_HCNT;
    __IO u32 IC_SS_SCL_LCNT;
    __IO u32 IC_FS_SCL_HCNT;
    __IO u32 IC_FS_SCL_LCNT;
    __IO u32 IC_HS_SCL_HCNT_RESERVED;
    __IO u32 IC_HS_SCL_LCNT_RESERVED;
    __IO u32 IC_INTR_STAT;
    __IO u32 IC_INTR_MASK;
    __IO u32 IC_RAW_INTR_STAT;
    __IO u32 IC_RX_TL;
    __IO u32 IC_TX_TL;
    __IO u32 IC_CLR_INTR;
    __IO u32 IC_CLR_RX_UNDER;
    __IO u32 IC_CLR_RX_OVER;
    __IO u32 IC_CLR_TX_OVER;
    __IO u32 IC_CLR_RD_REQ;
    __IO u32 IC_CLR_TX_ABRT;
    __IO u32 IC_CLR_RX_DONE;
    __IO u32 IC_CLR_ACTIVITY;
    __IO u32 IC_CLR_STOP_DET;
    __IO u32 IC_CLR_START_DET;
    __IO u32 IC_CLR_GEN_CALL;
    __IO u32 IC_ENABLE;
    __IO u32 IC_STATUS;
    __IO u32 IC_TXFLR;
    __IO u32 IC_RXFLR;
    __IO u32 IC_SDA_HOLD;
    __IO u32 IC_TX_ABRT_SOURCE_RESERVED;
    __IO u32 IC_SLV_DATA_NACK_ONLY_RESERVED;
    __IO u32 IC_DMA_CR;
    __IO u32 IC_DMA_TDLR_RESERVED;
    __IO u32 IC_DMA_RDLR_RESERVED;
    __IO u32 IC_SDA_SETUP;
    __IO u32 IC_ACK_GENERAL_CALL;
} I2C_TypeDef;
#endif



////////////////////////////////////////////////////////////////////////////////
/// @brief I2C type pointer Definition
////////////////////////////////////////////////////////////////////////////////
#define I2C1                            ((I2C_TypeDef*)I2C1_BASE)
#define I2C2                            ((I2C_TypeDef*)I2C2_BASE)



////////////////////////////////////////////////////////////////////////////////
/// @brief I2C_CR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define I2C_CR_MASTER_Pos               (0)
#define I2C_CR_MASTER                   (0x01U << I2C_CR_MASTER_Pos)            ///< I2C master mode enable
#define I2C_CR_SPEED_Pos                (1)
#define I2C_CR_SPEED                    (0x03U << I2C_CR_SPEED_Pos)             ///< I2C speed mode
#define I2C_CR_STD                      (0x01U << I2C_CR_SPEED_Pos)             ///< I2C standard speed mode
#define I2C_CR_FAST                     (0x02U << I2C_CR_SPEED_Pos)             ///< I2C fast speed mode
#define I2C_CR_SLAVE10_Pos              (3)
#define I2C_CR_SLAVE10                  (0x01U << I2C_CR_SLAVE10_Pos)           ///< I2C slave mode responds to 10-bit address
#define I2C_CR_MASTER10_Pos             (4)
#define I2C_CR_MASTER10                 (0x01U << I2C_CR_MASTER10_Pos)          ///< I2C master mode responds to 10-bit address
#define I2C_CR_REPEN_Pos                (5)
#define I2C_CR_REPEN                    (0x01U << I2C_CR_REPEN_Pos)             ///< Enable send RESTART
#define I2C_CR_SLAVEDIS_Pos             (6)
#define I2C_CR_SLAVEDIS                 (0x01U << I2C_CR_SLAVEDIS_Pos)          ///< I2C slave mode disable
#define I2C_CR_STOPINT_Pos              (7)
#define I2C_CR_STOPINT                  (0x01U << I2C_CR_STOPINT_Pos)           ///< Generate STOP interrupt in slave mode
#define I2C_CR_EMPINT_Pos               (8)
#define I2C_CR_EMPINT                   (0x01U << I2C_CR_EMPINT_Pos)            ///< I2C TX_EMPTY interrupt

